modules/admin/controllers/AdminController.php

SELECT `a`.`admin_role_id`, `a`.`admin_id`, `a`.`role_id`, `r`.`role_name`, `r`.`role_status` FROM `sys_admin_role` `a` LEFT JOIN `sys_role` `r` ON a.role_id=r.role_id
SELECT * FROM `sys_admin` WHERE `admin_id`=33
---
    public function actionIndex() {
        $session = Yii::$app->session;
        $get = Yii::$app->request->get();
        $admin_role_model = new Query();
        $adminIds = $this->getChildAdmin($session["admin_id"]);
        $admin_role_infos = $admin_role_model->select('a.admin_role_id,a.admin_id,a.role_id,r.role_name,r.role_status')
                ->from(['a' => 'sys_admin_role'])
                ->leftJoin(['r' => 'sys_role'], 'a.role_id=r.role_id')
                ->indexBy('admin_id')
                ->all();
        $adminModel = new Query();
        $allAdmins = $adminModel->select('*')
                ->from('sys_admin')
                ->where(["in", "admin_id", $adminIds]);
        if(!empty($get["admin_info"])){
            $allAdmins=$allAdmins->andWhere(["or",["like","admin_name",$get["admin_info"]],["like","nickname",$get["admin_info"]],["like","admin_tel",$get["admin_info"]]]);
        }
        $allAdmins=$allAdmins->indexBy('admin_id')
                ->all();