modules/admin/controllers/AuthController.php

INSERT INTO `sys_auth` (`auth_name`, `auth_url`, `auth_status`, `auth_pid`, `auth_level`, `auth_create_at`, `auth_update_at`) VALUES ('发送推送消息', '/website/applog/send-push', 1, 105, 1, '18/01/27 03:19:07', '18/01/27 03:19:07')
---
        $model->auth_create_at = date($format);
        $model->auth_update_at = date($format);
        if ($model->validate(["auth_name", "auth_url", "auth_create_at", "auth_update_at", "auth_pid"])) {
            $id = $model->save();