<?php

namespace app\modules\member\helpers;

class Constants{
    
    const GROWTH_SOURCE = [
        '1' => '登录',
        '2' => '购彩',
        '3' => '购彩天数奖励'
    ];
    
    const GROWTH_TYPE = [
        '1' => '固定值',
        '2' => '浮动值'
    ];
    
    const AUTHEN_STATUS = [
        '' => '请选择',
        '0' => '未认证',
        '1' => '已通过',
        '2' => '审核中',
        '3' => '未通过',
    ];
    
    const JZB_AUTHEN_STATUS = [
        '0' => '请选择',
        '1' => '未认证',
        '2' => '审核中',
        '3' => '已通过',
        '4' => '认证失败'
    ];
    
    const MEMBR_TYPE = [
        '0' => '请选择',
        '1' => '地推',
        '2' => '体彩店',
        '3' => '福彩店',
        '4' => '便利店',
        '5' => '个人'
    ];
    
    const COMPAR = [
        '0' => '请选择',
        '<=' => '<=',
        '=' => '==',
        '>=' => '>='
    ];
    
    const GENDER = [
        '0' => '请选择',
        '1' => '男',
        '2' => '女'
    ];
    
    const MEMBER_STATUS = [
        '0' => '请选择',
        '1' => '正常',
        '2' => '锁定',
        '3' => '挂失'
    ];
    
    const EX_TYPE = [
        '0' =>'请选择',
        '1' => '会员俱乐部兑换',
        '2' => '后台管理兑换',
//        '3' => '微信平台兑换'
    ];
    const YH_TYPE = [
//        '0' => '请选择',
        '1' => '代金券',
//        '2' => '折扣券'
        '3' => '咕币抵用券'
    ];
    const USE_RANGE = [
        '0' => '请选择',
        '1' => '微信支付',
        '2' => '支付宝支付',
        '3' => '咕啦钱包',
        '4' => '无使用范围限制'
    ];
    const IS_GIFT = [
        '0' => '请选择',
        '1' => '是',
        '2' => '否'
    ];
     //彩种分类
    const LOTTERY_TYPE=[
        "0"=>"全部彩种",
        "1"=>"全国彩种",
        "2"=>"地方彩种",
        "3"=>"高频彩种",
        "4"=>"全国福利彩种",
        "5"=>"全国体育彩种",
        "6"=>"11选5",
        "7"=>"快3",
        "8"=>"时时彩",
        "9"=>"快乐十分",
        "10"=>"竞技彩彩种",
        "11"=>"竞彩足球",
        "12"=>"竞彩篮球",
        "100"=>"购买文章",
        "101"=>"全场通用",
    ];
    const APPLICATION_TYPE = [
        '0' => '请选择',
        '1' => '系统发放类',
        '2' => '用户兑换类'
    ];
    //注册来源
    const REGFORM= [
        ''=>'请选择',
        '1'=>'咕啦自营',
        '2'=>'个人自营',
        '3'=>'贵人鸟加盟店',
        '5' => '代理商',
        '7'=>'推广人员',
        '8' => '平台推广',

    ];
    //活动类型
    const ACTIVITY_TYPE=[
        ''=>"请选择",
        '1'=>'注册',
    ];
    //活动状态
    const ACTIVITY_STATUS=[
        ''=>"请选择",
        '1'=>'启用',
        '2'=>'禁用',
    ];
    /**
     * 推广身份
     */
    const  SPREAD_TYPE=[
        ""=>"请选择",
        "0"=>"否",
        "4"=>"所有推广员",
        "1"=>"一级推广",
        "2"=>"二级推广",
        "3"=>"三级推广",
     ];
    /**
     * 邀请身份
     */
    const  INVITE_USER=[
        ""=>"请选择",
        "0"=>"否",
        "1"=>"是",

    ];
    /**
     * 兑换礼品支付类型
     */
    const PAY_TYPE=[
        '0'=>'请选择',
        '1'=>'咕币',
        '2'=>'电信积分',
    ];
    /**
     * 订单状态
     */
    const ORDER_STATUS = [
        '0' => '请选择',
        '1' => '未支付',
        '2' => '已支付'
    ];
    /**
     * 交易类型
     */
    const TRANSACTION_TYPE = [
        '0' => '请选择',
        '1' => '兑换礼品',
        '2' => '充值'
    ];
    
}
