modules/member/controllers/GiftListController.php

SELECT * FROM `gift_category` ORDER BY `gift_category_id`
---
    public function actionIndex() {
        $request = Yii::$app->request;
        $session = Yii::$app->session;
        $get = $request->get();
        $giftName = $request->get('gift_name', '');
        $cate = $request->get('cate_name', '');
        $status = $request->get('status', '');
        $type = $request->get('gift_type', '');
        //分类
        $data = GiftCategory::find()->orderBy('gift_category_id')->asArray()->all();

SELECT * FROM `gift_category` ORDER BY `gift_category_id`
SELECT `user_level_id`, `level_name` FROM `user_levels`
---
    public function actionAddgift() {
        if (Yii::$app->request->isGet) {
            //礼品类型
            $giftType = Constants::GIFT_TYPE;
            //礼品标识
            $mark = [
                "0" => "无标识",
                "1" => "新品",
                "2" => "热门",
            ];
            //礼品分类
            $data = GiftCategory::find()->orderBy('gift_category_id')->asArray()->all();
            $tree = array();
            $tree[0] = "请选择";
            $this->childtree($data, $tree, 0, "");
            //用户等级
            $userLevel = UserLevels::find()->select("user_level_id,level_name")->indexBy('user_level_id')->asArray()->all();

SELECT `batch` FROM `gift` WHERE `batch`='GL000002'
---
            $batch = array();
            $batch[0] = "请选择";
            foreach ($coupons as $k => $v) {
                $giftRes = Gift::find()->select("batch")->where(["batch" =>$v["batch"]])->asArray()->one();

UPDATE `gift` SET `status`=1 WHERE `gift_id`='5'
---
                "opt_id"=>$session['admin_id'],
                "modify_time"=>date('Y-m-d H:i:s'),
            ];
            $res = Gift::updateAll($updateData,["gift_id"=>$giftId]);