modules/member/controllers/GradeController.php

    public function actionIndex(){
//        $session = Yii::$app->session;
//        $agentCode = $session['agent_code'];
//        where(['agent_code'=>$agentCode])->
        $data = UserLevels::find()->orderBy('user_level_id')->asArray()->all();
---
SELECT * FROM `user_levels` ORDER BY `user_level_id`

    public function actionEditlevels(){
        $this->layout = false;
        if (Yii::$app->request->isGet) {
            $request = Yii::$app->request;
            $levelId = $request->get('levels_id','');
            if($levelId == ''){
                echo '操作错误';
                exit();
            }
            $data = UserLevels::find()->where(['user_level_id' => $levelId])->asArray()->one();
            return $this->render("editlevels", ['data'=>$data]);
        }elseif (Yii::$app->request->isAjax) {
            $request = Yii::$app->request;
            $session = Yii::$app->session;
            $post = $request->post();
            $upStatus = $request->post('up_statue',1);
            $levelId = $request->post('level_id','');
            if($levelId == ''){
                return $this->jsonResult(2,'参数有误','');
            }
            $only = UserLevels::find()->where(['level_name' => $post['level_name']])->andWhere(['!=','user_level_id',$levelId])->asArray()->one();
            if(!empty($only)){
                return $this->jsonResult(2,'该等级名称已存在，请重新填写','');
            }
            $data = UserLevels::find()->where(['user_level_id' => $levelId])->one();
---
SELECT * FROM `user_levels` WHERE (`level_name`='蒙猜大虾') AND (`user_level_id` != '2')
SELECT * FROM `user_levels` WHERE `user_level_id`='2'