modules/member/controllers/ListController.php

SELECT * FROM `user` WHERE `user_id`='272'
---
    public function actionEditStatus() {
        $post = Yii::$app->request->post();
        $user = User::findOne(["user_id" => $post["user_id"]]);