modules/member/controllers/RedeemController.php

SELECT `u`.*, `f`.`user_glcoin`, `f`.`all_funds` FROM `user` `u` LEFT JOIN `user_funds` `f` ON f.cust_no = u.cust_no WHERE ((`u`.`cust_no`='15805963038') OR (`u`.`user_name`='15805963038')) OR (`u`.`user_tel`='15805963038')
SELECT `u`.`cust_no`, sum(l.bet_money) pay FROM `lottery_order` `l` LEFT JOIN `user` `u` ON u.cust_no=l.cust_no WHERE (`l`.`status` IN (3, 4, 5)) AND ((`u`.`cust_no`='15805963038') OR (`u`.`user_name`='15805963038') OR (`u`.`user_tel`='15805963038'))
---
    public function actionSearch() {
        if (Yii::$app->request->isAjax) {
            $request = Yii::$app->request;
            $member = [];
            $userInform = $request->post('user_inform', '');
            $giftInform = $request->post('gift_inform', '');
            $session = Yii::$app->session;
            if ($userInform != '') {
                $statusArr = [3, 4, 5];
                $member = (new Query())->select('u.*,f.user_glcoin,f.all_funds')
                        ->from('user as u')
                        ->leftJoin('user_funds as f', 'f.cust_no = u.cust_no')
                        ->andWhere(["or",["u.cust_no"=>$userInform],["u.user_name"=>$userInform],["u.user_tel"=>$userInform]])
                        ->one();
                if(empty($member)){
                     return $this->jsonResult(109, '未查询到该会员记录！');
                }
//                $javaGetRealName = $this->agentsService->javaGetRealName($member->cust_no);
//                var_dump($javaGetRealName);
//                die;
                $member["paytotal"]=(new Query())->select("u.cust_no,sum(l.bet_money) pay")
                        ->from("lottery_order as l")
                        ->leftJoin("user as u","u.cust_no=l.cust_no")
                        ->where(["in","l.status",$statusArr])
                        ->andWhere(["or",["u.cust_no"=>$userInform],["u.user_name"=>$userInform],["u.user_tel"=>$userInform]])
                        ->one();
                return $this->jsonResult(600, '', $member);
            }
            $timer = date("Y-m-d H:i:s");
            if ($giftInform != '') {
                $giftList = Gift::find()->where([">=","in_stock",1])->andWhere(["or",["gift_name"=>$giftInform],["gift_code"=>$giftInform]])->andWhere([">","end_date",$timer])->asArray()->one();