modules/admin/models/SysRole.php

    public function roleList(){
        $session = Yii::$app->session;
        $roleAry=(new Query)->select("r.role_id")
                ->from("sys_admin_role as s")
                ->leftJoin("sys_role as r","r.role_id = s.role_id")
                ->where(["s.admin_id"=>$session["admin_id"]])
                ->one();
        if($roleAry["role_id"]!=24){
            $list = SysRole::find()->where(["or",["admin_id"=>$session["admin_id"]],["role_id"=>$roleAry["role_id"]]])->all();
        }else{
            $list = SysRole::find()->all();
---
SELECT * FROM `sys_role`