modules/lottery/models/League.php

    public function getLeagueitems($status,$type) {
        $leagues = League::find();
        if ($status != "") {
            $leagues = $leagues->where(["league_status" => $status]);
        }
        if ($status != "") {
            $leagues = $leagues->andWhere(["league_type" => $type]);
        }
        $leagues = $leagues->asArray()
                ->all();
---
SELECT * FROM `league` WHERE (`league_status`=1) AND (`league_type`=1)