modules/lottery/models/Lottery.php

    public function getLotterynamelist($condition = "1=1") {
        $result = $this->find()
                ->select("lottery_code,lottery_name")
                ->where($condition)
                ->asArray()
                ->all();
---
SELECT `lottery_code`, `lottery_name` FROM `lottery` WHERE 1=1