modules/common/services/TogetherService.php

    public static function getListDetail($programmeCode) {
        $query = new Query;
        $date = date('Y-m-d H:i:s');
        $status = Constants::PROGRAMME_STATUS;
        $securityArr = Constants::PROGRAMME_SECURITY;
        $football = Constants::MADE_FOOTBALL_LOTTERY;
        $basketball = CompetConst::MADE_BASKETBALL_LOTTERY;
        $list = [];
        $where = [];
        $field = ['p.programme_id', 'p.programme_code', 'p.expert_no', 'p.cust_type', 'p.store_id', 'p.lottery_name', 'p.lottery_code', 'p.periods', 'p.bet_val', 'p.play_code', 'p.play_name', 'p.bet_double', 'p.is_bet_add',
            'p.bet_money', 'p.count', 'p.security', 'p.royalty_ratio', 'p.minimum_guarantee', 'p.programme_end_time', 'p.programme_reason', 'p.programme_all_number', 'p.programme_peoples',
            'p.programme_speed', 'p.programme_last_amount', 'p.create_time', 'p.status', 'l.lottery_pic', 'p.bet_status', 's.store_name as ticke_name', 's.store_code as ticke_code', 'u.user_name', 'el.level_name',
            'el.made_nums', 'el.win_nums', 'el.win_amount as all_win_amount', 'el.level', 'p.programme_last_number', 'p.programme_univalent', 'p.made_nums'];
        if ($programmeCode != '') {
            $where['p.programme_code'] = $programmeCode;
        }
        $data = $query->select($field)
                ->from('programme as p')
                ->leftJoin('lottery as l', 'l.lottery_code = p.lottery_code')
                ->leftJoin('expert_level as el', 'el.cust_no = p.expert_no')
                ->leftJoin('store as s', 's.user_id = p.store_id')
                ->leftJoin('user as u', 'u.cust_no = p.expert_no')
                ->where($where)
                ->one();
        if (empty($data)) {
            return ['code' => 109, 'msg' => '该方案不存在'];
        }
        if (in_array($data['lottery_code'], $football)|| in_array($data['lottery_code'], $basketball) && !empty($data['count'])) {
                $odds = [];
                $oddsArr = (new Query)->select(['odds'])->from('lottery_order')->where(['programme_code' => $data['programme_code']])->one();
---
SELECT `p`.`programme_id`, `p`.`programme_code`, `p`.`expert_no`, `p`.`cust_type`, `p`.`store_id`, `p`.`lottery_name`, `p`.`lottery_code`, `p`.`periods`, `p`.`bet_val`, `p`.`play_code`, `p`.`play_name`, `p`.`bet_double`, `p`.`is_bet_add`, `p`.`bet_money`, `p`.`count`, `p`.`security`, `p`.`royalty_ratio`, `p`.`minimum_guarantee`, `p`.`programme_end_time`, `p`.`programme_reason`, `p`.`programme_all_number`, `p`.`programme_peoples`, `p`.`programme_speed`, `p`.`programme_last_amount`, `p`.`create_time`, `p`.`status`, `l`.`lottery_pic`, `p`.`bet_status`, `s`.`store_name` AS `ticke_name`, `s`.`store_code` AS `ticke_code`, `u`.`user_name`, `el`.`level_name`, `el`.`made_nums`, `el`.`win_nums`, `el`.`win_amount` AS `all_win_amount`, `el`.`level`, `p`.`programme_last_number`, `p`.`programme_univalent`, `p`.`made_nums` FROM `programme` `p` LEFT JOIN `lottery` `l` ON l.lottery_code = p.lottery_code LEFT JOIN `expert_level` `el` ON el.cust_no = p.expert_no LEFT JOIN `store` `s` ON s.user_id = p.store_id LEFT JOIN `user` `u` ON u.cust_no = p.expert_no WHERE `p`.`programme_code`='GLCFA1712131644F0000001'
SELECT `odds` FROM `lottery_order` WHERE `programme_code`='GLCFA1712131644F0000001'

        $data['status_name'] = $status[$data['status']];
        $data['prize'] = null;
        //获取更单人员信息
        $withPeople=(new Query())->select("cust_no,user_name,bet_money,buy_number,win_amount,create_time,programme_user_code")
                ->from("programme_user")
                ->where(["programme_code"=>$programmeCode])
                ->andWhere("status!=1")
                ->all();
---
SELECT `cust_no`, `user_name`, `bet_money`, `buy_number`, `win_amount`, `create_time` FROM `programme_user` WHERE (`programme_code`='GLCFA18020111F0000001') AND (status!=1)

        }
        if (in_array($code, $football)) {
            $field = ['schedule.schedule_code', 'schedule.schedule_mid', 'schedule.rq_nums', 'schedule.home_short_name', 'schedule.visit_short_name', 'sr.schedule_result_3006', 'sr.schedule_result_3007', 'sr.schedule_result_3008', 'sr.schedule_result_3009', 'sr.schedule_result_3010', 'sr.status'];
            $schedules = Schedule::find()
                    ->select($field)
                    ->join("left join", "schedule_result sr", "schedule.schedule_mid=sr.schedule_mid")
                    ->where(["in", "schedule.schedule_mid", $mids])
                    ->indexBy("schedule_mid")
                    ->asArray()
                    ->all();
---
SELECT `schedule`.`schedule_code`, `schedule`.`schedule_mid`, `schedule`.`rq_nums`, `schedule`.`home_short_name`, `schedule`.`visit_short_name`, `sr`.`schedule_result_3006`, `sr`.`schedule_result_3007`, `sr`.`schedule_result_3008`, `sr`.`schedule_result_3009`, `sr`.`schedule_result_3010`, `sr`.`status` FROM `schedule` left join `schedule_result` `sr` ON schedule.schedule_mid=sr.schedule_mid WHERE `schedule`.`schedule_mid` IN ('102068', '102058')