modules/member/models/UserLevels.php

    public function getLevelsList(){
        $data = $this->find()->asArray()->all();
---
SELECT * FROM `user_levels`