modules/lottery/controllers/BettingController.php

SELECT `lottery_order`.*, `store`.`store_name`, `store`.`phone_num` FROM `lottery_order` JOIN `store` ON store.user_id=lottery_order.store_id and store.store_code=lottery_order.store_no WHERE `lottery_order`.`lottery_order_id`='12403'
---
    public function actionReaddetail12() {
        $this->layout = false;
        $get = \Yii::$app->request->get();
        $data = LotteryOrder::find()->select("lottery_order.*,lottery_record.lottery_time,lottery_record.lottery_time,lottery_record.lottery_numbers,store.store_name,store.phone_num,pr.pay_pre_money")
                ->join("JOIN", "lottery_record", "lottery_record.periods=lottery_order.periods and lottery_record.lottery_code=lottery_order.lottery_id")
                ->join("JOIN", "store", "store.user_id=lottery_order.store_id and store.store_code=lottery_order.store_no")
                ->leftJoin("pay_record as pr", "pr.order_code=lottery_order.lottery_order_code and pr.pay_type=16")
                ->where(["lottery_order.lottery_order_id" => $get["lottery_order_id"]])
                ->asArray()
                ->one();
        $successStatus = [1, 2, 3, 4, 5, 11];
        $errorStatus = [6, 9, 10, 12];
        $where = "";
        if (in_array($data["status"], $successStatus)) {
            $where = "create_time asc";
        } else {
            $where = "create_time desc";
        }
        $payRecord = (new Query())->select("*")
                ->from("pay_record")
                ->where(["order_code" => $data["lottery_order_code"]])
                ->orderBy($where)
                ->one();
        $data["pic"] = (new Query())->select("order_img1,order_img2,order_img3,order_img4")
                ->from("out_order_pic")
                ->where(["order_id" => $data["lottery_order_id"]])
                ->one();