modules/lottery/controllers/LanscheduleController.php

SELECT * FROM `lan_schedule` WHERE `schedule_mid`='104201'
SELECT `result_3001`, `result_3002`, `result_3003`, `result_3004` FROM `lan_schedule_result` WHERE `schedule_mid`='104201'
---
    public function actionReadlanbonus() {
        $get = \Yii::$app->request->get();
        if (isset($get["schedule_mid"])) {
            $data = [];
            $data["schedule"] = LanSchedule::find()->where(["schedule_mid" => $get["schedule_mid"]])->asArray()->one();
            $data["3001"] = $this->getOdds("3001", $get["schedule_mid"]);
            $data["3002"] = $this->getOdds("3002", $get["schedule_mid"]);
            $data["3003"] = $this->getOdds("3003", $get["schedule_mid"]);
            $data["3004"] = $this->getOdds("3004", $get["schedule_mid"]);
            $query = new Query();
            $data["lan_schedule_result"] = $query->select("result_3001,result_3002,result_3003,result_3004")->from("lan_schedule_result")->where(["schedule_mid" => $get["schedule_mid"]])->all();

SELECT * FROM `odds_3001` WHERE `odds_3001_id`='1847'
---
    public function actionEditodds3001(){
        $this->layout = false;
        if (Yii::$app->request->isGet) {
            $request = Yii::$app->request;
            $id = $request->get('odds_3001_id', '');
            if ($id == '') {
                echo '参数错误';
                exit();
            }
            $data = Odds3001::find()->where(['odds_3001_id' => $id])->asArray()->one();