modules/lottery/controllers/LotteryController.php

SELECT * FROM `lottery_category` ORDER BY `lottery_category_id`
---
    public function actionIndex() {
        $model = new Lottery();
        $request = Yii::$app->request;
        $get = Yii::$app->request->get();
        $lotteryInfo = $request->get('lotteryInfo', '');
        $lottery = Lottery::find()->where("1=1");
        if ($lotteryInfo != '') {
            $lottery=$lottery->andWhere(["or",["lottery_code"=> $lotteryInfo],["lottery_name"=> $lotteryInfo]]);
        }
        if (isset($get["category_type"]) && !empty($get["category_type"])) {
            $lotteryCategory=new LotteryCategory;
            $Ary=$lotteryCategory->getLotteryType($get["category_type"]);
            $lottery=$lottery->andWhere(["in","lottery_category_id",$Ary]);
        }
        $lottery=$lottery->orderBy('lottery_sort, lottery_code');
        $provider = new ActiveDataProvider([
            'query' => $lottery,
            'pagination' => [
                'pageSize' => 10,
            ],
            'sort' => [
                'attributes' => ['lottery_code'],
            ],
        ]);

        $data = LotteryCategory::find()->orderBy('lottery_category_id')->asArray()->all();