modules/lottery/controllers/ScheduleController.php

SELECT `team_long_name`, `team_id` FROM `team`
---
    public function actionIndex() {
        $get = \Yii::$app->request->get();
        $data = [];
        $league = new League();
        $data["leagues"] = $league->getLeagueitems(1,1);
        $teams = Team::find()->select("team_long_name,team_id")->indexBy("team_id")->asArray()->all();