modules/agents/controllers/BussinessController.php

SELECT * FROM `bussiness_ip_white` WHERE (`bussiness_id`='7') AND (`status`=1)
SELECT * FROM `api_list` WHERE `status`=1
SELECT DISTINCT `bussiness_ip_id` FROM `api_ip`
SELECT DISTINCT `api_list_id` FROM `api_ip` WHERE `bussiness_ip_id` IN ('13', '16')
---
    public function actionAllotmentApi() {
        if (Yii::$app->request->isGet) {
            $get = Yii::$app->request->get();
            $bussinessId = $get["bussiness_id"];
            if (empty($bussinessId)) {
                return $this->jsonResult(109, "参数缺失");
            }
            $bussinessIp = BussinessIpWhite::find()->where(["bussiness_id" => $bussinessId])->andWhere(["status" => 1])->asArray()->all();
            $bussinessIdAry = [];
            if (!empty($bussinessIp)) {
                foreach ($bussinessIp as $v) {
                    array_push($bussinessIdAry, $v["bussiness_ip_white_id"]);
                }
            }
            $apiList = ApiList::find()->where(["status" => 1])->asArray()->all();
            //当前合作商IP数组，用于判断当前ip地址是否在权限关系表
            $ipAry = [];
            $ip = ApiIp::find()->select("bussiness_ip_id")->distinct("bussiness_ip_id")->asArray()->all();
            if (!empty($ip)) {
                foreach ($ip as $k => $v) {
                    array_push($ipAry, $v["bussiness_ip_id"]);
                }
            }
            //当前合作商API数组
            $apiAry = [];
            $api = ApiIp::find()->select("api_list_id")->distinct("api_list_id")->where(["in", "bussiness_ip_id", $bussinessIdAry])->asArray()->all();

SELECT * FROM `user` WHERE (`user_name`='comorange') OR (`cust_no`='comorange') OR (`user_tel`='comorange')
---
    public function actionGetUserInfo() {
        $post = Yii::$app->request->post();
        $user = User::find()->where(["or", ["user_name" => $post["userInfo"]], ["cust_no" => $post["userInfo"]], ["user_tel" => $post["userInfo"]]])->asArray()->one();