modules/agents/controllers/StoresController.php

    public function actionEditstore() {
        $get = \Yii::$app->request->get();
        $store = (new Query())->select("store.*,store_detail.*")->from("store")->join("left join", "store_detail", "store.store_id=store_detail.store_id")->where(["store.store_id" => $get["store_id"]])->one();
---
SELECT `store`.*, `store_detail`.* FROM `store` left join `store_detail` ON store.store_id=store_detail.store_id WHERE `store`.`store_id`='2'