modules/agents/controllers/SubagentsController.php

    public function actionReadagents() {
//        $this->layout = false;
        $get = \Yii::$app->request->get();
        $agents = Agents::find()->where(["agents_id" => $get["agents_id"]])->one();
---
SELECT * FROM `agents` WHERE `agents_id`='13'